import React, {useState} from 'react';
import Sidebar from "../Navbar_Sidebar/Sidebar";
import HelpEntityBody from "../../Help_Page/HelpEntityBody";

function StudentHelp() {

    const [faqs, setFaqs] = useState([
        {
            question: "Πως μπορώ να δω πληροφορίες για κάποιο από τα μαθήματά μου;",
            answer:
                "Αφού μπεις στη σελίδα 'Μαθήματα' του φοιτητή, μπορείς να δεις όλα τα μαθήματα που σε ενδιαφέρουν επιλέγοντας και τα κατάλληλα φίλτρα. Εφόσον βρεις το μάθημα που σε ενδιαφέρει στον πίνακα, πατώντας στον τίτλο του μεταφέρεσαι στην σελίδα με όλες τις διαθέσιμες πληροφορίες για το μάθημα αυτό.",
            open: true
        },
        {
            question: "Πως μπορώ να δω τις βαθμολογίες μου;",
            answer: "Μπαίνοντας στην σελίδα 'Βαθμολογίες' του φοιτητή, και εφόσον είσαι συνδεδεμένος, σου εμφανίζεται ένας πίνακας με όλους τους περασμένους βαθμούς. Χρησιμοποίησε τα διαθέσιμα φίλτρα για να βρεις αυτό που ψάχνεις πιο γρήγορα!",
            open: false
        },
        {
            question:
                "Πως μπορώ να εκδόσω ένα πιστοποιητικό;",
            answer: "Αφού μπεις στη σελίδα 'Πιστοποιητικά' του φοιτητή, επιλέξεις 'Νεό Πιστοποιητικό' και ακολουθήσεις τα βήματα που σου παρουσιάζονται, μπορείς πολύ απλά και γρήγορα να κάνεις την αίτησή σου. Όταν το πιστοποητικό σου εγκριθεί μπορείς να το βρεις στη σελίδα 'Πιστοποιητικά' ή και από το Προφίλ σου επιλέγοντας 'Πιστοποιητικά'. Μέχρι τότε ελέγχεις την κατάσταση της αίτησής στη σελίδα 'Πιστοποιητικά' χρησιμοποιώντας τα διαθέσιμα φίλτρα. Για να πραγματοποιηθεί η αίτηση θα πρέπει να έχεις συνδεθεί με τον ακαδημαϊκό σου λογαριασμό. ",
            open: false
        },
        {
            question:
                "Πως μπορώ να κάνω δήλωση μαθημάτων;",
            answer: "Η δήλωση μαθημάτων είναι δυνατή μόνο εφόσον βρισκόμαστε σε περίοδο δηλώσεων! Αφού μπεις στη σελίδα 'Δηλώσεις' του φοιτητή, μπορείς είτε να επιλέξεις 'Νέα δήλωση', είτε κάποια από τις 'Αποθηκευμένες δηλώσεις', προς υποβολή. Για να επιλέξεις τα μαθήματα που θέλεις απλά τσεκάρεις το κουτάκι που τους αντιστοιχεί. Όταν ολοκληρώνεις μια δήλωση μπορείς να την οριστικοποιήσεις, ή να την αποθηκεύσης προσωρινά. Κατά την περίοδο δηλώσεων μπορείς να οριστικοποιήσεις όσες δηλώσεις θέλεις, πάντα θα ισχύει η τελευταία. Μπορείς να δεις όλες τις οριστικοποιημένες δηλώσεις σου στις'Οριστικοποιημένες δηλώσεις'.",
            open: false
        }
    ]);

    const toggleFAQ = index => {
        setFaqs(
            faqs.map((faq, i) => {
                if (i === index) {
                    faq.open = !faq.open;
                } else {
                    faq.open = false;
                }

                return faq;
            })
        );
    };

    return (
        <div>
            <Sidebar/>

            <HelpEntityBody faqs={faqs} setFaqs={setFaqs} toggleFAQ={toggleFAQ}/>
        </div>
    );
}

export default StudentHelp;